IDEA Open Model
CheckResWeld Properties
Compatible with IDEA StatiCa 20.1
The CheckResWeld type exposes the following members.
Properties
Name | Description
CheckStatus
 Status of the Check
Id
 Unique id of weld
Items
 In case of presentation of groups plates (uncoiled beams)
LoadCaseId
 Id of Load Case
Name
 Name of Weld
UnityCheck
 Unity Check Stress
Top
See Also
Reference
CheckResWeld Class
IdeaRS.OpenModel.Connection Namespace